bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21J18AU.atdf
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
          <bitfield name="BODCORERDY" caption="BODCORE Ready" mask="0x8"/>
          <bitfield name="BODCOREDET" caption="BODCORE Detection" mask="0x10"/>
          <bitfield name="BCORESRDY" caption="BODCORE Synchronization Ready" mask="0x20"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
          <bitfield name="BODCORERDY" caption="BODCORE Ready" mask="0x8"/>
          <bitfield name="BODCOREDET" caption="BODCORE Detection" mask="0x10"/>
          <bitfield name="BCORESRDY" caption="BODCORE Synchronization Ready" mask="0x20"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="BODVDDRDY" caption="BODVDD Ready" mask="0x1"/>
          <bitfield name="BODVDDDET" caption="BODVDD Detection" mask="0x2"/>
          <bitfield name="BVDDSRDY" caption="BODVDD Synchronization Ready" mask="0x4"/>
          <bitfield name="BODCORERDY" caption="BODCORE Ready" mask="0x8"/>
          <bitfield name="BODCOREDET" caption="BODCORE Detection" mask="0x10"/>
          <bitfield name="BCORESRDY" caption="BODCORE Synchronization Ready" mask="0x20"/>
        </register>
        <register name="BODVDD" offset="0x10" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="BODVDD Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="HYST" caption="Hysteresis Enable" mask="0x4"/>
          <bitfield name="ACTION" caption="Action when Threshold Crossed" mask="0x18" values="SUPC_BODVDD__ACTION"/>
          <bitfield name="STDBYCFG" caption="Configuration in Standby mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ACTCFG" caption="Configuration in Active mode" mask="0x100"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF000" values="SUPC_BODVDD__PSEL"/>
          <bitfield name="LEVEL" caption="Threshold Level for VDD" mask="0x3F0000"/>
        </register>
        <register name="BODCORE" offset="0x14" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="BODCORE Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="HYST" caption="Hysteresis Enable" mask="0x4"/>
          <bitfield name="ACTION" caption="Action when Threshold Crossed" mask="0x18" values="SUPC_BODCORE__ACTION"/>
          <bitfield name="STDBYCFG" caption="Configuration in Standby mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ACTCFG" caption="Configuration in Active mode" mask="0x100"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF000" values="SUPC_BODCORE__PSEL"/>
          <bitfield name="LEVEL" caption="Threshold Level" mask="0x3F0000"/>
        </register>
        <register name="VREG" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="VREG Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
        </register>
        <register name="VREF" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="VREF Control">
          <bitfield name="TSEN" caption="Temperature Sensor Output Enable" mask="0x2"/>
          <bitfield name="VREFOE" caption="Voltage Reference Output Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Contrl" mask="0x80"/>
          <bitfield name="SEL" caption="Voltage Reference Selection" mask="0xF0000" values="SUPC_VREF__SEL"/>
        </register>
      </register-group>
      <value-group name="SUPC_BODVDD__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BODVDD generates a reset" value="0x1"/>
        <value name="INT" caption="The BODVDD generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="SUPC_BODVDD__PSEL">
        <value name="DIV2" caption="Divide clock by 2" value="0x0"/>
        <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
        <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
        <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
        <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
        <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
        <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
        <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
        <value name="DIV512" caption="Divide clock by 512" value="0x8"/>
        <value name="DIV1024" caption="Divide clock by 1024" value="0x9"/>
        <value name="DIV2048" caption="Divide clock by 2048" value="0xA"/>
        <value name="DIV4096" caption="Divide clock by 4096" value="0xB"/>
        <value name="DIV8192" caption="Divide clock by 8192" value="0xC"/>
        <value name="DIV16384" caption="Divide clock by 16384" value="0xD"/>
        <value name="DIV32768" caption="Divide clock by 32768" value="0xE"/>
        <value name="DIV65536" caption="Divide clock by 65536" value="0xF"/>
      </value-group>
      <value-group name="SUPC_BODCORE__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BODCORE generates a reset" value="0x1"/>
        <value name="INT" caption="The BODCORE generates an interrupt" value="0x2"/>
      </value-group>
