bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21J18AU.atdf
      <value-group name="SystemControl_ICSR__NMIPENDSET">
        <value name="VALUE_0" caption="Write: no effect; read: NMI exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes NMI exception state to pending; read: NMI exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the SysTick exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTSET">
        <value name="VALUE_0" caption="Write: no effect; read: SysTick exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the PendSV exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVSET">
        <value name="VALUE_0" caption="Write: no effect; read: PendSV exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__ENDIANNESS">
        <value name="VALUE_0" caption="Little-endian" value="0"/>
        <value name="VALUE_1" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__SYSRESETREQ">
        <value name="VALUE_0" caption="No system reset request" value="0"/>
        <value name="VALUE_1" caption="Asserts a signal to the outer system that requests a reset" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAMC21H" caption="SAMC21H">
      <pin position="A1" pad="PA00"/>
      <pin position="A2" pad="PA01"/>
      <pin position="A3" pad="PA03"/>
      <pin position="A4" pad="PB08"/>
      <pin position="A5" pad="PB09"/>
      <pin position="A6" pad="PA04"/>
      <pin position="A7" pad="PA06"/>
      <pin position="B1" pad="PB01"/>
      <pin position="B2" pad="PB02"/>
      <pin position="B3" pad="PA02"/>
      <pin position="B4" pad="PA09"/>
      <pin position="B5" pad="PA05"/>
      <pin position="B6" pad="PA07"/>
      <pin position="B7" pad="PA08"/>
      <pin position="C1" pad="PA31"/>
      <pin position="C2" pad="PB00"/>
      <pin position="C3" pad="PB03"/>
      <pin position="C4" pad="VDDANA"/>
      <pin position="C5" pad="VDDIO"/>
      <pin position="C6" pad="PA10"/>
      <pin position="C7" pad="PA11"/>
      <pin position="D1" pad="PA30"/>
      <pin position="D2" pad="VDDIN"/>
      <pin position="D3" pad="GNDANA"/>
      <pin position="D4" pad="GNDIO"/>
      <pin position="D5" pad="PB12"/>
      <pin position="D6" pad="PB11"/>
      <pin position="D7" pad="PB10"/>
      <pin position="E1" pad="VDDCORE"/>
      <pin position="E2" pad="GNDIO"/>
      <pin position="E3" pad="VDDIO"/>
      <pin position="E4" pad="GNDIO"/>
      <pin position="E5" pad="PB15"/>
      <pin position="E6" pad="PB14"/>
      <pin position="E7" pad="PB13"/>
      <pin position="F1" pad="RESET_N"/>
      <pin position="F2" pad="PA28"/>
      <pin position="F3" pad="PA23"/>
      <pin position="F4" pad="VDDIO"/>
      <pin position="F5" pad="GNDIO"/>
      <pin position="F6" pad="PA13"/>
      <pin position="F7" pad="PA12"/>
      <pin position="G1" pad="PB23"/>
      <pin position="G2" pad="PA27"/>
      <pin position="G3" pad="PA24"/>
      <pin position="G4" pad="PA20"/>
      <pin position="G5" pad="PA18"/>
      <pin position="G6" pad="PA14"/>
      <pin position="G7" pad="PA15"/>
      <pin position="H1" pad="PB22"/>
      <pin position="H2" pad="PA25"/>
      <pin position="H3" pad="PA22"/>
      <pin position="H4" pad="PA21"/>
      <pin position="H5" pad="PA19"/>
      <pin position="H6" pad="PA17"/>
      <pin position="H7" pad="PA16"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>